### 1. Import Pandas

In [2]:
import pandas as pd

### 2. Print Version of Pandas

In [102]:
pd.__version__

'2.2.2'

### 3. Print out all the version information of the libraries that are required by the pandas library.

In [4]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : d9cdd2ee5a58015ef6f4d15c7226110c9aab8140
python                : 3.12.3.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.21996
machine               : AMD64
processor             : Intel64 Family 6 Model 60 Stepping 3, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.2.2
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.8.2
setuptools            : None
pip                   : 24.0
Cython                : None
pytest                : None
hypothesis            : None
sphinx                : None
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : None
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : None
IPython               : 8.18.1
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
gcsfs                 : None
matplotlib            : None
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.2
pandas_gbq            : None
pyarrow               : None
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
zstandard             : None
tzdata                : 2024.1
qtpy                  : None
pyqt5                 : None

## DataFrame basics
### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames
##### Difficulty: easy

### 4. Create a DataFrame df from this dictionary data which has the index labels.

In [103]:
import numpy as np 

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [104]:
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 5. Display a summary of the basic information about this DataFrame and its data (hint: there is a single method that can be called on the DataFrame).

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [106]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

### 6. Return the first 3 rows of the DataFrame df.

In [107]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [108]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [11]:
df.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 7. Select just the 'animal' and 'age' columns from the DataFrame df.

In [12]:
df[["animal","age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

### 8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [13]:
df[["animal","age"]].iloc[[3,4,8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

### 9. Select only the rows where the number of visits is greater than 3.

In [14]:
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [15]:
df[df["visits"] > 2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

### 10. Select the rows where the age is missing, i.e. it is NaN.

In [16]:
df.isna()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [17]:
df[df["age"].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

### 11. Select the rows where the animal is a cat and the age is less than 3.

In [18]:
df[(df.animal=="cat")&(df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

### 12. Select the rows where age is between 2 and 4 (inclusive).

In [19]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [20]:
df[(df.age>=2)&(df.age <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

### 13. Change the age in row 'f' to 1.5.

In [21]:
df.loc['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 14. Calculate the sum of all visits in df (i.e. find the total number of visits).

In [22]:
df.sum()['visits']

19

### 15. Calculate the mean age for each different animal in df.

In [23]:
df.age.mean()

3.375

In [24]:
g= df.groupby('animal')

In [25]:
g.get_group("cat")

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  1.5       3       no
h    cat  NaN       1      yes

In [26]:
for animal,df in g :
    print(df)
    print() ## new line

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  1.5       3       no
h    cat  NaN       1      yes

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [27]:
df.groupby('animal')['age'].agg('mean')

animal
snake    2.5
Name: age, dtype: float64

In [28]:
df.groupby('animal')['age'].mean()

animal
snake    2.5
Name: age, dtype: float64

### 16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [29]:
df.loc['k'] = ['monkey', 2, 3, 'yes']
df.drop(index=['k'], inplace=True)
df

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

^^ 
Using inplace=True in the drop() method ensures that the operation modifies the original DataFrame df in place, without returning a new DataFrame. If inplace=True is not used, the drop() method will return a new DataFrame with the specified rows removed, but the original DataFrame df will remain unchanged.

### 17. Count the number of each type of animal in df.

In [30]:
animal_counts = df['animal'].value_counts()
print(animal_counts)

animal
snake    2
Name: count, dtype: int64

### 18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

In [31]:
df

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [32]:
df.sort_values(by="visits",ascending=False)

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [33]:
df.sort_values(by=["visits","age"])

  animal  age  visits priority
g  snake  4.5       1       no
c  snake  0.5       2       no

In [34]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age  visits priority
g  snake  4.5       1       no
c  snake  0.5       2       no

### 19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [35]:
df.replace({
    "no":"False",
    "yes" : "True"
})

  animal  age  visits priority
c  snake  0.5       2    False
g  snake  4.5       1    False

In [36]:
df.replace(["yes","no"],["True","False"])

  animal  age  visits priority
c  snake  0.5       2    False
g  snake  4.5       1    False

### 20. In the 'animal' column, change the 'snake' entries to 'python'.

In [37]:
df.replace(["snake"],["Python"])

   animal  age  visits priority
c  Python  0.5       2       no
g  Python  4.5       1       no

In [38]:
df['animal'].replace({'snake': 'python'}, inplace=True)
df

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_9956\1807925252.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['animal'].replace({'snake': 'python'}, inplace=True)

   animal  age  visits priority
c  python  0.5       2       no
g  python  4.5       1       no

### 21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [39]:
for animal,df in g :
    print(df)
    print() ## new line

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  1.5       3       no
h    cat  NaN       1      yes

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [40]:
pivot_table = df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')
pivot_table

visits    1    2
animal
snake   4.5  0.5

## DataFrames: beyond the basics

##### Difficulty: medium

### 22. You have a DataFrame df with a column 'A' of integers. 

#### For example:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

1, 2, 3, 4, 5, 6, 7

In [41]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [42]:
df_new = df["A"].unique()
pd.DataFrame(df_new)

##WORNG APPROACH!!

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7

In [43]:
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [44]:
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
Name: A, dtype: float64

In [45]:
df['A'] != df['A'].shift()

0      True
1      True
2     False
3      True
4      True
5      True
6     False
7     False
8      True
9      True
10    False
Name: A, dtype: bool

In [46]:
filtered_df = df[df['A'] != df['A'].shift()] ## ONLY TRUE VALUES WILL BE PRINTED 

filtered_df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

### 23. Given a DataFrame of numeric values, say

df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values

how do you subtract the row mean from each element in the row?

In [47]:
df = pd.DataFrame(np.ones((5, 3))) # a 5x3 frame of float values
df

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0

In [48]:
df.mean(axis=1)

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

In [49]:
df.sub(df.mean(axis=1), axis=0)

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
4  0.0  0.0  0.0

In [50]:
df = df - df.mean()
df

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
4  0.0  0.0  0.0

### 24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

Which column of numbers has the smallest sum? Return that column's label.

In [51]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.674281,0.053474,0.891796,0.950196,0.352795,0.204768,0.705356,0.937010,0.533991,0.478231
1,0.353300,0.266190,0.934129,0.256403,0.817486,0.735439,0.965678,0.084230,0.549501,0.908283
2,0.886561,0.675175,0.184758,0.414072,0.593678,0.993843,0.384007,0.190549,0.854606,0.913749
3,0.604780,0.754280,0.698651,0.691164,0.455804,0.441102,0.322786,0.861444,0.236809,0.958312
4,0.070309,0.818658,0.531969,0.782629,0.492847,0.257000,0.723235,0.209157,0.371465,0.962415

In [52]:
df.sum()

a    2.589231
b    2.567777
c    3.241304
d    3.094463
e    2.712610
f    2.632151
g    3.101062
h    2.282389
i    2.546372
j    4.220991
dtype: float64

In [53]:
df.sum().min()

2.282389150887311

In [54]:
df.sum().idxmin()

'h'

In [55]:
df.sum().idxmax()

'j'

### 25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? 
As input, use a DataFrame of zeros and ones with 10 rows and 3 columns.

In [56]:
np.random.randint (0,1)

0

In [57]:
np.random.randint(0, 2, size=(10, 3))

array([[1, 0, 0],
       [1, 0, 0],
       [0, 1, 0],
       [0, 0, 1],
       [0, 0, 1],
       [1, 1, 1],
       [0, 0, 0],
       [0, 0, 0],
       [1, 0, 1],
       [0, 1, 0]])

In [58]:
df = pd.DataFrame(np.random.randint(0, 2, size=(5, 3)))
df

   0  1  2
0  0  1  0
1  1  1  0
2  0  1  0
3  1  1  1
4  1  0  1

In [59]:
df = df.drop_duplicates() ## drops duplicate rows
df

   0  1  2
0  0  1  0
1  1  1  0
3  1  1  1
4  1  0  1

### 26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the column which contains the third NaN value.

You should return a Series of column labels: e, c, d, h, d

In [60]:
nan=np.nan
data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

col= ["a","b","c","d","e","f","g","h","i","j"]

p=pd.DataFrame(data,columns=col)
p

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [61]:
p.isna()

       a     b      c      d      e      f      g      h      i      j
0  False  True   True  False   True  False  False  False   True   True
1   True  True   True  False  False   True   True  False  False  False
2   True  True  False   True  False  False   True   True  False  False
3  False  True   True  False  False  False  False   True   True   True
4   True  True  False   True  False   True  False   True  False  False

In [62]:
p[p.isna()]

    a   b   c   d   e   f   g   h   i   j
0 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
4 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN

In [63]:
def third_nan_col(row):
    nan_cols = row.index[row.isna()]
    return nan_cols[2] if len(nan_cols) >= 3 else None

result_series = p.apply(third_nan_col, axis=1)

print(result_series)

0    e
1    c
2    d
3    h
4    d
dtype: object

# PROBLEM ^^

### 27. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 

                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

For each group, find the sum of the three greatest values. You should end up with the answer as follows:


grps

a               409

b                156

c               345

In [64]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [65]:
g= df.groupby("grps")

In [66]:
for grps,df in g:
    print(df)
    print()

  grps  vals
0    a    12
1    a   345
2    a     3
6    a     4
7    a    52

   grps  vals
3     b     1
4     b    45
8     b    54
12    b    57
13    b     3

   grps  vals
5     c    14
9     c    23
10    c   235
11    c    21
14    c    87

In [67]:
group_sums = df.groupby('grps')['vals'].sum() ### TOTAL SUM
print(group_sums)

grps
c    380
Name: vals, dtype: int64

In [68]:
def sum_of_three_greatest(group):
    sorted_vals = group.sort_values(ascending=False) ###
    return sorted_vals.iloc[:3].sum()

In [69]:
df.groupby('grps')['vals'].apply(sum_of_three_greatest).reset_index()

  grps  vals
0    c   345

### 28. The DataFrame df constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive).


For each group of 10 consecutive integers in 'A' (i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.

#### || SKIPPED 28 ###

## DataFrames: harder problems

### 29. Consider a DataFrame df where there is an integer column 'X':


df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be


[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
Make this a new column 'Y'.

### 30. Consider the DataFrame constructed below which contains rows and columns of numerical data.


Create a list of the column-row index locations of the 3 largest values in this DataFrame. In this case, the answer should be:


[(5, 7), (6, 4), (2, 5)]

### 31. You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals'.


df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
                   
Create a new column 'patched_values' which contains the same values as the 'vals' any negative values in 'vals' with the group mean:

### 32. Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:


>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})

|| SKIPPED (29-32) The Harder Problems

# Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data
##### Difficulty: easy/medium

### 33. Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series s.

In [70]:
business_days = pd.bdate_range("2015-01-01", "2015-12-31") ##Prints business days

In [71]:
values = np.random.randint(100,size=len(business_days))
values

array([35, 50, 68, 22, 50, 57, 52, 51,  5, 19, 79, 94, 38, 32, 11, 67, 58,
       72, 95, 63, 37, 85, 78, 89, 10, 75, 76,  2, 22, 96, 28, 94, 91, 41,
       11, 73, 15, 66, 70, 68, 11, 52, 23, 72,  0, 90, 48, 17,  5, 24, 94,
       26, 44, 96,  8, 30, 77, 49, 83, 43, 16, 24,  6, 88, 45, 39, 67,  9,
       73, 42, 45, 62, 33, 18, 41,  4, 69, 94, 81, 87, 15, 57, 62, 88, 81,
        5, 79, 31, 67, 98, 57, 36, 17, 16, 68, 92,  1, 70, 93, 86, 83, 63,
       93, 72, 62, 69, 85, 49,  6, 76, 57, 27, 64, 34,  6, 24, 71, 96, 30,
       50, 93, 72, 88, 70, 86, 63, 73, 64, 27, 98, 72, 63, 44, 52, 68, 32,
       42, 32,  6, 33, 44, 58, 72, 48, 67, 53, 91, 19, 93, 29, 49, 20, 79,
       27, 98, 24, 56, 98, 83, 13, 71, 52, 39, 86, 67, 30, 93, 81, 81, 89,
       27, 22, 16, 16, 83, 64, 76,  0, 33, 88, 79, 62, 19, 52,  6, 74, 64,
        2, 53, 67, 47, 97, 67, 64, 73, 78, 76, 64, 66,  4, 68, 43,  4, 89,
       76, 29, 23, 62, 63,  3, 85, 98, 84, 65, 70, 98, 23, 72, 82, 78, 36,
       32, 91, 81, 74,  1, 88, 14, 91, 73, 66, 16, 64, 41, 15, 75, 58, 86,
       41, 92, 25, 75, 11, 36, 11,  3,  1, 64, 96, 19,  1, 97, 32, 54, 18,
       51, 19, 65, 41, 92, 63])

In [72]:
s= pd.Series(values ,index = business_days )
s

2015-01-01    35
2015-01-02    50
2015-01-05    68
2015-01-06    22
2015-01-07    50
              ..
2015-12-25    19
2015-12-28    65
2015-12-29    41
2015-12-30    92
2015-12-31    63
Freq: B, Length: 261, dtype: int32

### 34. Find the sum of the values in s for every Wednesday.

In [73]:
s.index

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-05', '2015-01-06',
               '2015-01-07', '2015-01-08', '2015-01-09', '2015-01-12',
               '2015-01-13', '2015-01-14',
               ...
               '2015-12-18', '2015-12-21', '2015-12-22', '2015-12-23',
               '2015-12-24', '2015-12-25', '2015-12-28', '2015-12-29',
               '2015-12-30', '2015-12-31'],
              dtype='datetime64[ns]', length=261, freq='B')

In [74]:
s.index.day_name()

Index(['Thursday', 'Friday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday',
       'Friday', 'Monday', 'Tuesday', 'Wednesday',
       ...
       'Friday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday',
       'Monday', 'Tuesday', 'Wednesday', 'Thursday'],
      dtype='object', length=261)

In [75]:
count = 0
for index_date in s.index:
    if index_date.day_name() == "Wednesday":
        count = count+1

print("Count of Wednesdays:", count)  ##counting total wednesday

Count of Wednesdays: 52

In [76]:
s[s.index.day_name() == "Wednesday"]

2015-01-07    50
2015-01-14    19
2015-01-21    11
2015-01-28    63
2015-02-04    10
2015-02-11    96
2015-02-18    11
2015-02-25    68
2015-03-04     0
2015-03-11    24
2015-03-18     8
2015-03-25    43
2015-04-01    45
2015-04-08    42
2015-04-15    41
2015-04-22    87
2015-04-29    81
2015-05-06    98
2015-05-13    68
2015-05-20    86
2015-05-27    62
2015-06-03    76
2015-06-10     6
2015-06-17    50
2015-06-24    86
2015-07-01    98
2015-07-08    68
2015-07-15    33
2015-07-22    67
2015-07-29    29
2015-08-05    98
2015-08-12    13
2015-08-19    67
2015-08-26    89
2015-09-02    83
2015-09-09    88
2015-09-16     6
2015-09-23    67
2015-09-30    73
2015-10-07     4
2015-10-14    76
2015-10-21     3
2015-10-28    70
2015-11-04    78
2015-11-11    74
2015-11-18    73
2015-11-25    15
2015-12-02    92
2015-12-09    11
2015-12-16    19
2015-12-23    18
2015-12-30    92
dtype: int32

In [77]:
wednesday_sum = s[s.index.day_name() == "Wednesday"].sum()
wednesday_sum

2735

### 35. For each calendar month in s, find the mean of values.

In [78]:
months = s.index.month_name()
months

Index(['January', 'January', 'January', 'January', 'January', 'January',
       'January', 'January', 'January', 'January',
       ...
       'December', 'December', 'December', 'December', 'December', 'December',
       'December', 'December', 'December', 'December'],
      dtype='object', length=261)

In [79]:
a = s.groupby(months).mean()
a

April        50.772727
August       58.666667
December     43.782609
February     53.400000
January      51.818182
July         51.521739
June         55.727273
March        43.772727
May          63.714286
November     58.761905
October      57.772727
September    53.909091
dtype: float64

In [80]:
a.sort_values()

March        43.772727
December     43.782609
April        50.772727
July         51.521739
January      51.818182
February     53.400000
September    53.909091
June         55.727273
October      57.772727
August       58.666667
November     58.761905
May          63.714286
dtype: float64

In [81]:
a.sort_index()

April        50.772727
August       58.666667
December     43.782609
February     53.400000
January      51.818182
July         51.521739
June         55.727273
March        43.772727
May          63.714286
November     58.761905
October      57.772727
September    53.909091
dtype: float64

In [82]:
a = a.reindex(['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'])  # Sort the mean values by month names
a

January      51.818182
February     53.400000
March        43.772727
April        50.772727
May          63.714286
June         55.727273
July         51.521739
August       58.666667
September    53.909091
October      57.772727
November     58.761905
December     43.782609
dtype: float64

In [83]:
s.resample("M").mean()

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_9956\377855557.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  s.resample("M").mean()

2015-01-31    51.818182
2015-02-28    53.400000
2015-03-31    43.772727
2015-04-30    50.772727
2015-05-31    63.714286
2015-06-30    55.727273
2015-07-31    51.521739
2015-08-31    58.666667
2015-09-30    53.909091
2015-10-31    57.772727
2015-11-30    58.761905
2015-12-31    43.782609
Freq: ME, dtype: float64

### 36. For each group of four consecutive calendar months in s, find the date on which the highest value occurred.

In [84]:
 s.resample('4M').max()

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_9956\2826011332.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  s.resample('4M').max()

2015-01-31    95
2015-05-31    98
2015-09-30    98
2016-01-31    98
Freq: 4ME, dtype: int32

In [85]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_9956\1554433663.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-27
2015-05-31   2015-05-06
2015-09-30   2015-07-01
2016-01-31   2015-10-23
Freq: 4ME, dtype: datetime64[ns]

### 37. Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [86]:
pd.date_range("2015-01-01", "2016-12-31",freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

INFO : 

'ChatGPT'

The parameter freq='WOM-3THU' is a frequency specification used by Pandas to generate dates. Let's break it down:

WOM: This stands for "Week Of Month". It's used to specify which week of the month to consider.
-3: This indicates the third week of the month.
THU: This specifies the day of the week, which in this case is Thursday.
So, WOM-3THU specifies the third Thursday of each month.

There are various other frequency specifications you can use with Pandas to generate different date ranges. Some common ones include:

'D': Daily frequency
'W': Weekly frequency
'M': Month end frequency
'A': Year end frequency
'H': Hourly frequency
And many more. You can also combine these with other options like specifying which day of the week or which week of the month, as we did with 'WOM-3THU'. This flexibility allows you to generate date ranges that meet specific requirements for your analysi

## Cleaning Data

In [87]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 38. Some values in the the FlightNumber column are missing (they are NaN). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify df to fill in these missing numbers and make the column an integer column (instead of a float column).

In [88]:
df['FlightNumber'] = np.arange(10045,10086,10)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### 39. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [89]:
temp =df.copy()

In [90]:
temp = df.From_To.str.split('_', expand=True)
temp.columns = ['From', 'To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [91]:
#temp[['From', 'To']] = temp['From_To'].str.split('_', expand=True)

#temp

### 40. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [92]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### 41. Delete the From_To column from df and attach the temporary DataFrame 'temp' from the previous questions.df and attach the temporary DataFrame from the previous questions.

In [93]:
df=df.drop(columns=["From_To"])
df = df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### 42. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. '(British Airways. )' should become 'British Airways'.

In [94]:
df['Airline'] = df['Airline'].str.extract(r'([a-zA-Z\s]+)')
df

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

In [95]:
df['Airline'] = df['Airline'].str.replace('[^a-zA-Z\s]', '')

print(df)

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_9956\719207309.py:1: SyntaxWarning: invalid escape sequence '\s'
  df['Airline'] = df['Airline'].str.replace('[^a-zA-Z\s]', '')

### 43. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.


Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [96]:
df

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

In [97]:
delays= df["RecentDelays"]
delays

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [98]:
delays.apply(pd.Series)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [99]:
len(delays.columns)

AttributeError: 'Series' object has no attribute 'columns'

In [ ]:
list(range(1,10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [ ]:
delays = df['RecentDelays'].apply(pd.Series)

delays.columns = [f'delay_{n}' for n in range(1, len(delays.columns) + 1)]

df = df.drop('RecentDelays', axis=1).join(delays)

df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

## Using MultiIndexes
### Go beyond flat DataFrames with additional index levels
##### Difficulty: medium

### 44. Given the lists letters = ['A', 'B', 'C'] and numbers = list(range(10)), construct a MultiIndex object from the product of the two lists. Use it to index a Series of random numbers. Call this Series s.

In [111]:
letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers], names=['Letter', 'Number'])
values = np.random.randint(100, size=len(mi))

s = pd.Series(values, index=mi)
s

Letter  Number
A       0         35
        1         43
        2         88
        3         22
        4         97
        5         14
        6         33
        7         47
        8         40
        9         95
B       0         27
        1         73
        2          8
        3         82
        4         39
        5         39
        6         79
        7         16
        8         53
        9         43
C       0          0
        1         19
        2         51
        3         15
        4         49
        5         21
        6          7
        7         50
        8         48
        9          3
dtype: int32

### 45. Check the index of s is lexicographically sorted (this is a necessary proprty for indexing to work correctly with a MultiIndex).

In [112]:
s

Letter  Number
A       0         35
        1         43
        2         88
        3         22
        4         97
        5         14
        6         33
        7         47
        8         40
        9         95
B       0         27
        1         73
        2          8
        3         82
        4         39
        5         39
        6         79
        7         16
        8         53
        9         43
C       0          0
        1         19
        2         51
        3         15
        4         49
        5         21
        6          7
        7         50
        8         48
        9          3
dtype: int32

### 46. Select the labels 1, 3 and 6 from the second level of the MultiIndexed Series.

In [113]:
s.loc[:,[1,3,6]] ##as it said labels so loc was used

Letter  Number
A       1         43
        3         22
        6         33
B       1         73
        3         82
        6         79
C       1         19
        3         15
        6          7
dtype: int32

### 47. Slice the Series s; slice up to label 'B' for the first level and from label 5 onwards for the second level.

In [114]:
s.loc[:'A',5:]

Letter  Number
A       5         14
        6         33
        7         47
        8         40
        9         95
dtype: int32

In [115]:
s.loc[:'B',5:]

Letter  Number
A       5         14
        6         33
        7         47
        8         40
        9         95
B       5         39
        6         79
        7         16
        8         53
        9         43
dtype: int32

In [116]:
s.loc["B":,5:7]

Letter  Number
B       5         39
        6         79
        7         16
C       5         21
        6          7
        7         50
dtype: int32

### 48. Sum the values in s for each label in the first level (you should have Series giving you a total for labels A, B and C).

In [117]:
s

Letter  Number
A       0         35
        1         43
        2         88
        3         22
        4         97
        5         14
        6         33
        7         47
        8         40
        9         95
B       0         27
        1         73
        2          8
        3         82
        4         39
        5         39
        6         79
        7         16
        8         53
        9         43
C       0          0
        1         19
        2         51
        3         15
        4         49
        5         21
        6          7
        7         50
        8         48
        9          3
dtype: int32

In [118]:
s.groupby(level=0).sum()

Letter
A    514
B    459
C    263
dtype: int32

In [119]:
s.groupby(level=0).mean()

Letter
A    51.4
B    45.9
C    26.3
dtype: float64

In [120]:
s.groupby(level=1).sum()

Number
0     62
1    135
2    147
3    119
4    185
5     74
6    119
7    113
8    141
9    141
dtype: int32

### 49. Suppose that sum() (and other methods) did not accept a level keyword argument. How else could you perform the equivalent of s.sum(level=1)?

In [121]:
s

Letter  Number
A       0         35
        1         43
        2         88
        3         22
        4         97
        5         14
        6         33
        7         47
        8         40
        9         95
B       0         27
        1         73
        2          8
        3         82
        4         39
        5         39
        6         79
        7         16
        8         53
        9         43
C       0          0
        1         19
        2         51
        3         15
        4         49
        5         21
        6          7
        7         50
        8         48
        9          3
dtype: int32

In [122]:
s.unstack()

Number   0   1   2   3   4   5   6   7   8   9
Letter
A       35  43  88  22  97  14  33  47  40  95
B       27  73   8  82  39  39  79  16  53  43
C        0  19  51  15  49  21   7  50  48   3

In [123]:
s.unstack().sum(axis=0)

Number
0     62
1    135
2    147
3    119
4    185
5     74
6    119
7    113
8    141
9    141
dtype: int64

In [124]:
s.unstack().sum(axis=1)

Letter
A    514
B    459
C    263
dtype: int64

### 50. Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). Is this new Series properly lexsorted? If not, sort it.

In [125]:
ss = s.swaplevel()

ss

Number  Letter
0       A         35
1       A         43
2       A         88
3       A         22
4       A         97
5       A         14
6       A         33
7       A         47
8       A         40
9       A         95
0       B         27
1       B         73
2       B          8
3       B         82
4       B         39
5       B         39
6       B         79
7       B         16
8       B         53
9       B         43
0       C          0
1       C         19
2       C         51
3       C         15
4       C         49
5       C         21
6       C          7
7       C         50
8       C         48
9       C          3
dtype: int32